InformationRegisters/ОбъектыКОбновлениюПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКОбновлениюПечатныхФорм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаИнтеграцииС1СДокументооборотом</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаИнтеграцииС1СДокументооборотом3</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнтеграцияС1СДокументооборотВсеСсылкиПереопределяемый</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбъектыКОбновлениюПечатныхФорм/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет объекты ИС в очередь на обновление печатных форм в связанных объектах ДО.
//
// Параметры:
//   Объект - ОпределяемыйТип.ИнтеграцияС1СДокументооборотВсеСсылкиПереопределяемый - ссылка на объект ИС.
//   Правило - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом
//           - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом3 - правило интеграции,
//     соответствующее объекту ИС.
//
Процедура Добавить(Объект, Правило) Экспорт
	
	ПоддерживаетсяОбновлениеФайлов =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("2.1.9.1.CORP");
		
	Если Не ПоддерживаетсяОбновлениеФайлов Тогда
		Возврат;
	КонецЕсли;
	
	Менеджер = РегистрыСведений.ОбъектыКОбновлениюПечатныхФорм.СоздатьМенеджерЗаписи();
	
	Менеджер.Объект = Объект;
	Менеджер.Правило = Правило;
	
	Менеджер.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
